-- Вставка тестовых данных в схему tarificator
-- Вставка тестовых данных в выработку
INSERT INTO tarificator.productivity
VALUES -- Вставка выработки для ответственного лица
       ('32bc0e52-8325-465c-a969-93d09cc8ed0c',
        'a218592a-86f6-45ac-9e9d-63a7b70c2a0b',
        'cbc79f25-ab55-4fc6-b149-13d63ef698d0',
        'responsible_person',
        '2023-11-13 11:03:14.00000'),
       ('d10bc795-0620-42fb-9539-b0390dd82723',
        '4cb24169-cb16-4bf8-a4fd-0fa3cef4fbad',
        'cea09d66-f41a-4b94-a955-0d33610153e1',
        'responsible_person',
        '2023-11-13 11:03:14.00000'),
       ('589bb2b1-982c-42dd-84cf-16943870672a',
        'a9d1e540-4a4e-4d55-883f-6cda83336d45',
        '4ee79d3f-04a7-4baa-903d-cf43de15b654',
        'responsible_person',
        '2023-11-13 11:03:14.00000'),
       ('803a65fe-d3e0-4ac8-a71a-1420bf0b0152',
        'a9d1e540-4a4e-4d55-883f-6cda83336d45',
        'b7e4fb40-bb27-413e-b015-87f6ce0eae6d',
        'responsible_person',
        '2023-11-13 11:03:14.00000'),
       -- Вставка выработки для арбитра 
       ('28b1d30e-1782-460a-8f47-7ac951e4561d',
        'adaae422-3686-4605-81d7-d8c6471896f2',
        'cbc79f25-ab55-4fc6-b149-13d63ef698d0',
        'arbitr',
        '2023-11-13 11:03:14.00000'),
       ('b1619d9c-3574-47df-86ca-0b4989501334',
        'adaae422-3686-4605-81d7-d8c6471896f2',
        'cea09d66-f41a-4b94-a955-0d33610153e1',
        'arbitr',
        '2023-11-13 11:03:14.00000'),
       ('da3e1bc0-3a6a-4764-b747-8cab2f94cc77',
        'adaae422-3686-4605-81d7-d8c6471896f2',
        '4ee79d3f-04a7-4baa-903d-cf43de15b654',
        'arbitr',
        '2023-11-13 11:03:14.00000'),
       ('5911c677-3b1b-4ff8-8d4a-4fef9fb3e2d0',
        'adaae422-3686-4605-81d7-d8c6471896f2',
        'b5eadb23-c008-4d53-b2ba-8d1e86c64906',
        'arbitr',
        '2023-11-13 11:03:14.00000')
ON CONFLICT DO NOTHING;

-- Вставка тестовых данных в справочник ошибок
INSERT INTO tarificator.penaltyerror
VALUES (1, 'Не собраны все необходимые доказательства (фото, видео)', FALSE),
       (2, 'Неверно выбрано виновное лицо', FALSE),
       (3, 'Некорректно оценены все необходимые доказательства (фото, видео)', FALSE)
ON CONFLICT DO NOTHING;

-- Вставка тестовых данных в ошибки ответственных лиц
INSERT INTO tarificator.penalty
VALUES ('14d77c31-01aa-4283-b807-4598c3a738f2',
        'a9d1e540-4a4e-4d55-883f-6cda83336d45',
        '4ee79d3f-04a7-4baa-903d-cf43de15b654',
        1,
        '2023-11-30 11:42:23.00000')
ON CONFLICT DO NOTHING;